app/Http/Controllers/HomeController.php

    public function index()
    {
        $month   = Carbon::today();
        $earning = LoanEarn::select('*')->whereMonth('created_at', Carbon::now()->month)->where('type', 'earn')->SUM('loan_amount');
        $loan    = LoanEarn::select('*')->whereMonth('created_at', Carbon::now()->month)->where('type', 'loan')->SUM('loan_amount');
        $cost    = Cost::select('*')->whereMonth('created_at', Carbon::now()->month)->SUM('amount');
---
select sum(`loan_amount`) as aggregate from `loan_earns` where month(`created_at`) = '02' and `type` = 'earn'
select sum(`loan_amount`) as aggregate from `loan_earns` where month(`created_at`) = '02' and `type` = 'loan'
select sum(`amount`) as aggregate from `costs` where month(`created_at`) = '02'